jyyy3901/GD32_HAL_Compat/Port/gd32_instance_map.c
#include "gd32_hal_port.h"
#include "stm32_hal_instance_map.h"
#include <stddef.h>

#define TIMER_CHANNELS_4 \
    (GD32_HAL_CAP_CHANNEL_1 | GD32_HAL_CAP_CHANNEL_2 | \
     GD32_HAL_CAP_CHANNEL_3 | GD32_HAL_CAP_CHANNEL_4)
#define TIMER_CHANNELS_2 \
    (GD32_HAL_CAP_CHANNEL_1 | GD32_HAL_CAP_CHANNEL_2)

static const GD32_HAL_Resource gd32HalResources[] =
{
    {STM32_GPIO_INSTANCE_A, GD32_HAL_GPIOA_ADDRESS, GD32_HAL_GPIOA_ADDRESS,
     RCU_GPIOA, -1, 0U, 0U, 0U},
    {STM32_GPIO_INSTANCE_B, GD32_HAL_GPIOB_ADDRESS, GD32_HAL_GPIOB_ADDRESS,
     RCU_GPIOB, -1, 0U, 1U, 0U},
    {STM32_GPIO_INSTANCE_C, GD32_HAL_GPIOC_ADDRESS, GD32_HAL_GPIOC_ADDRESS,
     RCU_GPIOC, -1, 0U, 2U, 0U},
    {STM32_GPIO_INSTANCE_D, GD32_HAL_GPIOD_ADDRESS, GD32_HAL_GPIOD_ADDRESS,
     RCU_GPIOD, -1, 0U, 3U, 0U},

    {STM32_UART_INSTANCE_1, GD32_HAL_USART0_ADDRESS, GD32_HAL_USART0_ADDRESS,
     RCU_USART0, STM32_HAL_IRQ_USART1,
     GD32_HAL_CAP_FLOW_CONTROL | GD32_HAL_CAP_DMA, 1U, 0U},
    {STM32_UART_INSTANCE_2, GD32_HAL_USART1_ADDRESS, GD32_HAL_USART1_ADDRESS,
     RCU_USART1, STM32_HAL_IRQ_USART2,
     GD32_HAL_CAP_FLOW_CONTROL | GD32_HAL_CAP_DMA, 2U, 0U},
    {STM32_UART_INSTANCE_6, GD32_HAL_USART2_ADDRESS, GD32_HAL_USART2_ADDRESS,
     RCU_USART2, STM32_HAL_IRQ_USART6,
     GD32_HAL_CAP_FLOW_CONTROL | GD32_HAL_CAP_DMA, 6U, 0U},

    {STM32_DMA0_CHANNEL0, GD32_HAL_DMA0_CHANNEL0_ADDRESS, GD32_HAL_DMA0_ADDRESS,
     RCU_DMA0, DMA0_Channel0_IRQn, GD32_HAL_CAP_DMA, 0U, 0U},
    {STM32_DMA0_CHANNEL1, GD32_HAL_DMA0_CHANNEL1_ADDRESS, GD32_HAL_DMA0_ADDRESS,
     RCU_DMA0, DMA0_Channel1_IRQn, GD32_HAL_CAP_DMA, 0U, 1U},
    {STM32_DMA0_CHANNEL2, GD32_HAL_DMA0_CHANNEL2_ADDRESS, GD32_HAL_DMA0_ADDRESS,
     RCU_DMA0, DMA0_Channel2_IRQn, GD32_HAL_CAP_DMA, 0U, 2U},
    {STM32_DMA0_CHANNEL3, GD32_HAL_DMA0_CHANNEL3_ADDRESS, GD32_HAL_DMA0_ADDRESS,
     RCU_DMA0, DMA0_Channel3_IRQn, GD32_HAL_CAP_DMA, 0U, 3U},
    {STM32_DMA0_CHANNEL4, GD32_HAL_DMA0_CHANNEL4_ADDRESS, GD32_HAL_DMA0_ADDRESS,
     RCU_DMA0, DMA0_Channel4_IRQn, GD32_HAL_CAP_DMA, 0U, 4U},
    {STM32_DMA0_CHANNEL5, GD32_HAL_DMA0_CHANNEL5_ADDRESS, GD32_HAL_DMA0_ADDRESS,
     RCU_DMA0, DMA0_Channel5_IRQn, GD32_HAL_CAP_DMA, 0U, 5U},
    {STM32_DMA0_CHANNEL6, GD32_HAL_DMA0_CHANNEL6_ADDRESS, GD32_HAL_DMA0_ADDRESS,
     RCU_DMA0, DMA0_Channel6_IRQn, GD32_HAL_CAP_DMA, 0U, 6U},
    {STM32_DMA1_CHANNEL0, GD32_HAL_DMA1_CHANNEL0_ADDRESS, GD32_HAL_DMA1_ADDRESS,
     RCU_DMA1, DMA1_Channel0_IRQn, GD32_HAL_CAP_DMA, 1U, 0U},
    {STM32_DMA1_CHANNEL1, GD32_HAL_DMA1_CHANNEL1_ADDRESS, GD32_HAL_DMA1_ADDRESS,
     RCU_DMA1, DMA1_Channel1_IRQn, GD32_HAL_CAP_DMA, 1U, 1U},
    {STM32_DMA1_CHANNEL2, GD32_HAL_DMA1_CHANNEL2_ADDRESS, GD32_HAL_DMA1_ADDRESS,
     RCU_DMA1, DMA1_Channel2_IRQn, GD32_HAL_CAP_DMA, 1U, 2U},
    {STM32_DMA1_CHANNEL3, GD32_HAL_DMA1_CHANNEL3_ADDRESS, GD32_HAL_DMA1_ADDRESS,
     RCU_DMA1, DMA1_Channel3_IRQn, GD32_HAL_CAP_DMA, 1U, 3U},
    {STM32_DMA1_CHANNEL4, GD32_HAL_DMA1_CHANNEL4_ADDRESS, GD32_HAL_DMA1_ADDRESS,
     RCU_DMA1, DMA1_Channel4_IRQn, GD32_HAL_CAP_DMA, 1U, 4U},

    {STM32_TIM_INSTANCE_1, GD32_HAL_TIMER0_ADDRESS, GD32_HAL_TIMER0_ADDRESS,
     RCU_TIMER0, STM32_HAL_IRQ_TIM1_UP_TIM10,
     GD32_HAL_CAP_ADVANCED | GD32_HAL_CAP_MASTER_SLAVE | GD32_HAL_CAP_TRGO |
     GD32_HAL_CAP_DMA | TIMER_CHANNELS_4, 1U, 0U},
    {STM32_TIM_INSTANCE_2, GD32_HAL_TIMER1_ADDRESS, GD32_HAL_TIMER1_ADDRESS,
     RCU_TIMER1, STM32_HAL_IRQ_TIM2,
     GD32_HAL_CAP_MASTER_SLAVE | GD32_HAL_CAP_TRGO | GD32_HAL_CAP_DMA |
     TIMER_CHANNELS_4, 2U, 0U},
    {STM32_TIM_INSTANCE_3, GD32_HAL_TIMER2_ADDRESS, GD32_HAL_TIMER2_ADDRESS,
     RCU_TIMER2, STM32_HAL_IRQ_TIM3,
     GD32_HAL_CAP_MASTER_SLAVE | GD32_HAL_CAP_TRGO | GD32_HAL_CAP_DMA |
     TIMER_CHANNELS_4, 3U, 0U},
    {STM32_TIM_INSTANCE_4, GD32_HAL_TIMER3_ADDRESS, GD32_HAL_TIMER3_ADDRESS,
     RCU_TIMER3, STM32_HAL_IRQ_TIM4,
     GD32_HAL_CAP_MASTER_SLAVE | GD32_HAL_CAP_TRGO | GD32_HAL_CAP_DMA |
     TIMER_CHANNELS_4, 4U, 0U},
    {STM32_TIM_INSTANCE_5, GD32_HAL_TIMER4_ADDRESS, GD32_HAL_TIMER4_ADDRESS,
     RCU_TIMER4, STM32_HAL_IRQ_TIM5,
     GD32_HAL_CAP_MASTER_SLAVE | GD32_HAL_CAP_TRGO | GD32_HAL_CAP_DMA |
     TIMER_CHANNELS_4, 5U, 0U},
    {STM32_TIM_INSTANCE_9, GD32_HAL_TIMER8_ADDRESS, GD32_HAL_TIMER8_ADDRESS,
     RCU_TIMER8, STM32_HAL_IRQ_TIM1_BRK_TIM9,
     GD32_HAL_CAP_MASTER_SLAVE | GD32_HAL_CAP_TRGO | TIMER_CHANNELS_2, 9U, 0U},
    {STM32_TIM_INSTANCE_10, GD32_HAL_TIMER9_ADDRESS, GD32_HAL_TIMER9_ADDRESS,
     RCU_TIMER9, STM32_HAL_IRQ_TIM1_UP_TIM10,
     GD32_HAL_CAP_CHANNEL_1, 10U, 0U},
    {STM32_TIM_INSTANCE_11, GD32_HAL_TIMER10_ADDRESS, GD32_HAL_TIMER10_ADDRESS,
     RCU_TIMER10, STM32_HAL_IRQ_TIM1_TRG_TIM11,
     GD32_HAL_CAP_CHANNEL_1, 11U, 0U},
    {STM32_ADC_INSTANCE_1, GD32_HAL_ADC0_ADDRESS, GD32_HAL_ADC0_ADDRESS,
     RCU_ADC0, STM32_HAL_IRQ_ADC1, GD32_HAL_CAP_DMA, 1U, 0U},

    {STM32_I2C_INSTANCE_1, GD32_HAL_I2C0_ADDRESS, GD32_HAL_I2C0_ADDRESS,
     RCU_I2C0, STM32_HAL_IRQ_I2C1_EV, GD32_HAL_CAP_DMA, 1U, 0U},
    {STM32_I2C_INSTANCE_2, GD32_HAL_I2C1_ADDRESS, GD32_HAL_I2C1_ADDRESS,
     RCU_I2C1, STM32_HAL_IRQ_I2C2_EV, GD32_HAL_CAP_DMA, 2U, 0U},

    {STM32_SPI_INSTANCE_1, GD32_HAL_SPI0_ADDRESS, GD32_HAL_SPI0_ADDRESS,
     RCU_SPI0, STM32_HAL_IRQ_SPI1, GD32_HAL_CAP_DMA, 1U, 0U},
    {STM32_SPI_INSTANCE_2, GD32_HAL_SPI1_ADDRESS, GD32_HAL_SPI1_ADDRESS,
     RCU_SPI1, STM32_HAL_IRQ_SPI2, GD32_HAL_CAP_DMA, 2U, 0U},
    {STM32_SPI_INSTANCE_3, GD32_HAL_SPI2_ADDRESS, GD32_HAL_SPI2_ADDRESS,
     RCU_SPI2, STM32_HAL_IRQ_SPI3, GD32_HAL_CAP_DMA, 3U, 0U}
};

static GD32_HAL_ResourceKind GD32_HAL_KindOf(const GD32_HAL_Resource *resource)
{
    const uint32_t token_kind = ((uint32_t)resource->stm32_instance >> 8U) & 0xFFU;

    switch (token_kind)
    {
        case 0x01U: return GD32_HAL_RESOURCE_GPIO;
        case 0x02U: return GD32_HAL_RESOURCE_UART;
        case 0x03U: return GD32_HAL_RESOURCE_TIMER;
        case 0x04U: return GD32_HAL_RESOURCE_ADC;
        case 0x05U: return GD32_HAL_RESOURCE_DMA;
        case 0x06U: return GD32_HAL_RESOURCE_I2C;
        default: return GD32_HAL_RESOURCE_SPI;
    }
}

const GD32_HAL_Resource *GD32_HAL_ResolveInstance(uintptr_t stm32_instance,
                                                  GD32_HAL_ResourceKind kind)
{
    size_t index;

    for (index = 0U; index < (sizeof(gd32HalResources) / sizeof(gd32HalResources[0]));
         ++index)
    {
        if ((gd32HalResources[index].stm32_instance == stm32_instance) &&
            (GD32_HAL_KindOf(&gd32HalResources[index]) == kind))
        {
            return &gd32HalResources[index];
        }
    }
    return NULL;
}
